perf/metar.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      payload:
        path: "stations.csv"
        order: sequence
        fields:
          - "station"
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Light Plain 
      duration: 120
      arrivalRate: 10
    - name: Light Ramp
      duration: 60
      arrivalRate: 10 
      rampTo: 60
    - name: Intermediate Plain
      duration: 120
      arrivalRate: 60 
    - name: Heavy Ramp
      duration: 60
      arrivalRate: 60
      rampTo: 200
    - name: Heavy Plain
      duration: 120
      arrivalRate: 200
    - name: Extreme Ramp
      duration: 60
      arrivalRate: 200
      rampTo: 300
    - name: Extreme Plain
      duration: 120
      arrivalRate: 300

scenarios:
  - name: Metar Load Test (/)
    flow:
      - get:
          url: '/metar?station={{ station }}'