perf/quote.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Light Plain 
      duration: 120
      arrivalRate: 1
    - name: Light Ramp
      duration: 60
      arrivalRate: 1 
      rampTo: 3
    - name: Intermediate Plain
      duration: 120
      arrivalRate: 3
    - name: Heavy Ramp
      duration: 60
      arrivalRate: 3
      rampTo: 6
    - name: Heavy Plain
      duration: 120
      arrivalRate: 6
    - name: Extreme Ramp
      duration: 120
      arrivalRate: 6
      rampTo: 30
    - name: Extreme Plain
      duration: 120
      arrivalRate: 30

scenarios:
  - name: Quote Load Test (/)
    flow:
      - get:
          url: '/Quote'